{
 "name": "Sony MDRZX110/BLK ZX Series Stereo Headphones (Black)",
 "catagories": "Home Audio & Theater",
 "star-rating": "4.3 out of 5 stars",
 "customer-reviews-count": "6,494 ratings",
 "long-reviews": [
  "I had a pair from this headphone line in the past, and used them until they basically fell apart (one side stopped working, and the cushioning material for the ears eventually peeled away.)  And yet after trying myriad other brands, I rate these as my personal best.  After my first pair died (took several years of daily use), I went on a quest to try a bunch of different headphones.  After wasting hundreds of dollars over the past couple years on everything from fancy $200 pairs, cheap Amazon-branded pairs, and plenty of random ones from places like Big Lots or Walmart, I finally just came back to these for a meager $15.  There's simply no beating the combination of comfort (especially for people with glasses!), sound quality, and price.  I work in front of a computer for hours at a time, and almost always have headphones (and eye glasses) on.  I probably have a larger than average head shape too.  Every single other pair I have tried ended up making my ears hurt before long, except this one.  While the construction quality is decent, I do expect to run through a new pair every couple years, but at this price point, it's really hard to complain.  In summary, I am so thankful these are back in my life.",
  "These phones sound really nice, for being under $20. I have owned at least 30 different headphones since 1974, and these sound as good as any of the $100 Sennheisers I had back when Elton John's \"Rocket Man\" was new music. The power requirement for the voice coils in these phones is remarkably low: They sound great for listening to music on a cell phone or tablet, and you won't even have to crank the volume up to maximum. Some of the headphones I have owned recently don't work well with mobile devices, requiring more output power than the audio chip in a cell phone can provide - that won't be a problem with these Sony ZX-110 phones. They sound just fine on my Samsung Galaxy Tab S at 50% of max volume. Frequency response is very good for economy priced phones, with clear treble and adequate bass response to let you \"feel\" the drums and bass guitar. Soprano and contralto vocals sound nice and clear, without that \"muddy\" sound that cheap phones give that don't have enough high-frequency response. These phones fold up into a very small, compact footprint that is easy to store in a medium or large purse, or any briefcase, backpack, or laptop computer bag. The cord is 3 feet, and has a 90° angled plug. This cord length is great for use with a cell phone in a shirt pocket, although not really long enough for home use with a desktop computer. If you are going to use these phones to listen to music on a home stereo or desktop computer, you will need an extension cord, but these aren't terribly expensive.COMFORT: Sony got this right: these phones grip your head just firmly enough to stay in place, without squeezing you to death. I have had a couple of Sony phones that were horrible in this respect, with way too much compression on an average sized head; that's not a problem with these phones. The ear pads are very comfortable, and they don't press hard enough on your earlobes to make you need to take your earrings off to use the phones.SUMMARY: A Typical Sony economy-priced headphone with much better sound than you might have expected at this price point. Folds up very small for carrying in a purse or laptop computer bag, Very comfortable to wear for up to several hours.PRODUCT RECOMMENDATION: HIGHLY RECOMMENDED",
  "These are great headphones for music and movies for the price.  I have never owned a big-money pair of headphones & after buying cheap ones that I had to replace multiple times due to breakage, I decided to get these after a recommendation from a friend.  After buying them for myself, I also bought them for each of my kids.  They're great for average use... i've never been bothered by outside noise, they are comfortable, and the sound is of good quality.  They also are much sturdier than the cheapie $10-$20 ones I've gotten before.  (My kids haven't broken them, which is a minor miracle)I do recommend getting a bag or carrying case for them (I use a Crown Royal bag:) it certainly helps protect them and they do seem vulnerable at the hinges where they collapse for storage.The only thing my kid complains about is the wire is kind of short. I prefer it because the wire is nice and thick and never gets tangled.  with my previous cheap ones, it was always the wires that were delicate & one or both ears would go out.  These are so much sturdier. (I think he just finds them too short when he wants to sit in the recliner with his iPad on the table & watch his Minecraft. If you don't require your headphones to meet these specific and ridiculous needs, the length should be fine.)",
  "The ear piece covers are already starting to peel.  I have owned this for 2 weeks and have used these 3 times.  I didn't think they would fall apart in days.  I would avoid this and look for something else.",
  "Arrived on time & in good / new condition. Sound quality is mediocre, but these are a heck of a lot better than dealing w/ the tears-inducing migraine that comes from headphones that squeeze my ears and jaw. They're not as comfortable as they claim to be, but markedly more comfortable than the Amazon Basics ones of similar appearance. If you're looking for something practical, and can handle a very short cord, like if you're on your laptop, these are for you. Wouldn't use them for exercise or movement of any sort. I'll  probably buy them again, if they randomly short out on me. I'd say they're worth the $15 I paid, but if the price goes up, I won't buy them again. :) -Account holder's progeny",
  "Love the look of these and the sound quality is good, particularly for the price. I have a small-ish head size and these boxed my ears so bad the first week I wore them. Ouch! Another reviewer mentioned to stretch them out by leaving them around a sofa armrest or something like that, and after doing that, I haven't had any trouble with my ears hurting."
 ],
 "asin": [
  "B00NJ2M33I"
 ]
}