{
    "name": "COWIN E7 Active Noise Cancelling Headphones Bluetooth Headphones with Microphone Deep Bass Wireless Headphones Over Ear, Comfortable Protein Earpads, 30 Hours Playtime for Travel/Work, Black",
    "catagories": "All Electronics",
    "star-rating": "4.4 out of 5 stars",
    "customer-reviews-count": "22,707 ratings",
    "long-reviews": [
        "Wow. These are absolutely phenomenal headphones. I bought them about a year and a half ago and I use them all the time. I had a pair of on ear headphones from a no-name brand a few years ago and, while they served their purpose, they were not impressively loud and became a little aggravating on the ears after a while. These sit very comfortably on my head while I do chores around the house or yard work etc. I run a mobile auto detailing business in my spare time and use them for that as well.  I don’t have a particularly large head and they fit nicely, but I imagine they would be better for someone with a big noggin. If I find myself looking down for too long they will start to slip off my head. I wouldn’t even attempt to do any kind of cardio with these. Weightlifting, sure but running - no. They are too loose and when using the noise canceling feature, any excess movement makes it crackle.The noise canceling is pretty decent. It’s not Bose quality but it’s plenty powerful to muffle a mower, vacuum or grinder. It almost entirely mutes plane noise. Like I mentioned, it doesn’t take much jostling to make it crackle, but if it becomes too annoying I just turn the NC off.Sound quality is also pretty good. Depending on the app/song I’m listening to, it can get EXTREMELY loud.  So much so that I have to turn it down - which is saying something because I listen to my music on full blast most of the time. Sound quality is marginally better with the NC on, but marginally louder with NC off.Build construction is solid enough. Kind of feels like a few steps up from just cheap plastic. Don’t get me wrong - it IS cheap plastic but it presents itself well. Pads are very soft and so far the body has been durable. I’ve dropped these on the ground a few times and, while they are covered in scratches, they are still performing fabulously.Finally, and very importantly, the battery life on these is UNPRECEDENTED. I mean I will use these for hours a day for like 2 weeks in a row before even thinking about charging them. I think they advertise 16 hours, but no joke I have probably used these for 40+ hours between charges and they still weren’t dead. Unbelievable. There is also a widget for the iPhone but I’ve found it to be entirely inaccurate.Bluetooth connection is lightning fast and has superb distance. In an open field I’ve used them further than 80’ from my phone.Gripes: I have only a few.My biggest gripe is the piss poor Siri support. There is not a designated Siri button which sucks. And it wouldn’t be so bad, but there is about a 4 second delay between Siri activation and the prompt to begin speaking. I hope they addressed this with the E8’s.There is an LED on the command switch that never turns off and is quite bright. Also not a huge deal, but it bothers my wife if I try to wear them in bed.Lastly, the hinges of the earpieces have become a little squeaky and loose after a year. Overall, these are minute gripes that I actually had to think about to put in here.Overall these are a fantastic set of headphones and have earned their 5-stars from me. I bought another product from Cowin and had to get in touch with their customer support and was very pleased. I will buy from Cowin in the futureUpdate: 10-11-18I am still using these headphones and continue to be blown away by their deceptively good quality. I mean these suckers refuse to die. I’ve added a few photos this time to show how much abuse they’ve taken over the past few years. The leather is gnarled over the headpiece. There are scratches everywhere. I’ve even dropped this pair off my roof by accident. They didn’t care. They laughed and kept playing the ‘Man of Steel’ film score. Not even joking - that really happened. The battery life remains miraculous. Still getting 30+ hours of play time on full volume. That is an absolute feat considering the common life of Li-Ion batteries. The buttons still work. The Noise Cancelling still works. And despite their twisted appearance, they remain unconventionally comfortable. In my previous post I mentioned that they had started to squeak around the hinges. Yeah that just stopped. I am seriously astounded by these headphones and wonder if I’ll ever even need to upgrade to the E8’s. In any case - Cowin has still got my vote when it comes down to a reasonably priced headphone of extraordinary longevity.Update: 12-17-19My (probably) final thoughts:These headphones have transcended my expectations in quality - So much so that I’ve anthropomorphized them.  Yup they’re basically my buddy. I have been using these every day for 3 YEARS and have not had one single issue with them. Sure the skin is falling off.. And... uh... yeah nope that’s it. That’s literally the only problem plaguing these headphones. I was broke when I bought these (still broke but that’s not relevant) and they have gone above and beyond their purpose for how much I paid for them.  The battery STILL lasts days, the sound quality has not diminished at all, and I am still beating the snot out of these things. I was expecting these to last MAYBE 18 months before I had to search for something else. 3 years later, I’m now looking into a pair of AirPods to replace my dailies, but I’ll be keeping these as backups and for studio work - probably forever. I buy a lot of stuff on Amazon (remember that thing about being broke?) but I hold these headphones with the utmost respect as possibly the best purchase I’ve ever made on this site.Cowin - you guys are doing something right. You’ve made a lifelong customer and I can’t recommend your products enough. Well done.Now go buy these headphones!",
        "I want to give special attention and rating to COWIN's AMAZING customer service.I never imagined they could be so kind and understanding and after contacting them I just had to go back and write this thankful review.I'm using the headphones for music, TV, PlayStation and they work great. The noise canceling feature does a nice job for that matter as well.",
        "I am not a professional of any sort, just a 69 year old guy who wears hearing aides who wanted a good and comfortable pair of wireless headphones to use with my laptop while watching Netflix and YouTube. Bought two pair, the other one for my wife.The Cowin E-7 is a beautifully crafted, very comfortable, noise cancelling headphone and the sound quality everything I had hoped for. It paired up quickly with my HP Laptop on the first attempt without any hesitation. The fit and finish is near perfect in my opinion. The attractive brushed aluminum frame is very attractive, well padded and oh so smooth to the touch. It came with a nice leather like travel bag, a cord for direct connection to a cell phone, laptop or other similar device and a USB cable for charging the lithium battery. After performing a good long over night first-time battery charge, I used them for six continuous hours glorious comfortable hours. There was no fading of sound and the battery seemed to be ready for several more hours of use. The volume control is smooth and adjusts easily. The sound remained clear, crisp and easy to listen to from the highest to the lowest volume setting.Comparable headphones at Walmart are mych more expensive and their cheaper ones are...well, cheap for a reason. Been there, done that. I would highly recommend these to anyone looking for a reasonably priced, high quality, noise cancelling wireless headphone and I would buy them again in a nano second.",
        "This product is on par with big brand names (and I have used several of them including Bose and Dr. Beats for over 6 months). It works just fine with cellphones and tablets. When turned on, it automatically connects to my cellphone every time after the initial set up. Voice quality for phone conversations is good; people at the other end could easily hear me. Wired connection is good as well.When one side of the heaphone did not work, I contacted the seller. They promptly responded back and took care of the issue, which I'm very happy about. I would highly recommend this product and the seller.",
        "Nicely packed. They are light have great sound. I noticed if you have the noise cancelling on and you barely bump them they make a crackling sound also the music sounds more like it's in a hall. With noise cancelling off they sound excellent crisp sound great bass the works. They are great headphones. UPDATE: THESE HEADPHONES ARE STILL AWESOME.MUSIC SOUNDS BETTER ON BLUTOOTH AND NOT WITH THE NOISE CANCELLING ON. YOU CAN SAVE $10.00 BY BUYING THE VERSION WITHOUT NOISE CANCELLING. THEY REALLY DON'T CANCEL OUT NOISE BUT WITH THE MUSIC PLAYING YOU DON'T HEAR OUTSIDE NOISE AND THE MUSIC SOUNDS LIKE YOUR THERE OR EVEN BETTER. GREAT QUALITY AND WORKMANSHIP. VERY WELL BUILT"
    ],
    "asin": [
        "B019U00D7K3"
    ]
}