{
    "name": "Apple EarPods with Lightning Connector - White",
    "catagories": [],
    "star-rating": "4.3 out of 5 stars",
    "customer-reviews-count": "8,663 ratings",
    "long-reviews": [
        "I use my earbuds for singing and immediately noticed a change in the mic quality. Even the texture is different. But I thought hey, still a good deal! Fast forward two months. These things just crackled and sent little mini shock of electric into my ears while listening to a voicenotes in iMessage! Like the kind of quick spark you get when you rub your feet on a carpet and touch someone. But continuous. I yanked them out and threw them in the trash. I’ll go buy from Apple website now. You get what you pay for.",
        "I just got the headphones like this ! Open and empty box 😡",
        "After losing my iPhone7 EarPods, I bought these replacements---crossing my fingers that these would be legit Apple products (my order was \"Sold by Amazon\" new as a Prime Exclusive). I miraculously found my original EarPods so when these arrived I compared them directly to see whether they matched up. The ones Amazon sent me are just like the ones I got with my phone, and the packaging is just like all my other classic Apple stuff: everything sealed, meticulously held in place, documentation, etc.Photos below show all the box details and the packaged EarPods. The only thing that seemed slightly different was the thickness of the main cord---these are a tiny bit thinner it feels like (but I got my IPhone7 some time ago so these might be the \"current\" version). As for sound, I can't tell any difference between my original EarPods and these replacements.  My one star off is because the shape of the actual earpiece is not my favorite. That's just preference---or ear size, maybe?UPDATE: looks like Amazon isn't always offering these as Prime-Exclusive, or at all. I would never go for these if listed by others, new or used. Head to the Apple Store otherwise!",
        "I bought 3 pairs of these headphones for Christmas gifts for my daughters and they have all quit working. I bought them one month early before Christmas but they have only been able to use them since 12/25 and already broken.",
        "I want to start off by saying I hardly ever write reviews, unless I think the product is simply so amazing I have to let others know or it was so god awful I hope to steer others away from it. This is a case of the latter. After receiving them, they worked fine for one day and then stopped working. A little background: I ONLY use these headphones at work AT my desk, so there's no chance they fell in water or were stepped on or anything. Here are all the issues I encountered:Could only plug the lightning cord in one way, if you flipped it and inserted it wouldn't recognize the headphones and would play through my iPhone's speakersOne earbud stopped working completelyThe microphone stopped working completelyThe volume would increase and decrease on it's own",
        "(Please read entire review before basing opinion)When I recieved this product I immediately started using it since after my last pair broke I had no replacement so I had to use my iPhone without earphones for 2 weeks. At first it seemed like my product was working perfectly fine so I started binge watching YouTube videos to catch-up on most of the videos I missed (mainly asmr videos) however after a few hours I had to unplug my earphones to plug in my charging cable and charge my phone. The next day, I woke up unplugged my iPhone from the charger plugged in my earphones and on my way to school I noticed that the right earphone wasn’t working anymore..I’ve tried to make myself remember if by mistake I may have pulled the lighting jack a little to hard and ruined the product but I’m usually very gentle about this so I don’t think it was my fault however, not being 100% sure, I can’t accuse this product of being faulty. So to be clear this product worked fine like it was supposed to at first but then didn’t.",
        "Bought less than a month ago and they are already on the fritz. They keep activating voice control, cutting off whatever I'm currently using them for (listening to audio, talking hands-free). It's driving me crazy and is a major disappointment.",
        "I accidentally left my IPhone 7 headphones on a plane when traveling with family. These work as well as the original ones. Would buy them again."
    ],
    "asin": [
        "B01M0GB8CC7"
    ]
}