{
    "name": "Mpow 059 Bluetooth Headphones Over Ear, Hi-Fi Stereo Wireless Headset, Foldable, Soft Memory-Protein Earmuffs, w/Built-in Mic Wired Mode PC/Cell Phones/TV",
    "catagories": "All Electronics",
    "star-rating": "4.4 out of 5 stars",
    "customer-reviews-count": "30,312 ratings",
    "long-reviews": [
        "Got these for my 13 year old who listens to music constantly. They are great sound and they block out the annoying sounds from his younger brother so he can enjoy his music. They fold up nice for going in his book ag while at school.",
        "UPDATE #2: MPOW contacted me and sent me new pair free-of-charge. Great customer service. The new pair is definitely a welcome improvement over the pair in my initial review. The sound is less muffled, bass is deeper and more solid. I don’t hear as much “boom” as I did with the previous pair, suggesting that MPOW has resolved that issue. The new pair arrived in a lovely white box, a welcomed improvement over the original. I hope this new pair lasts much longer but only time will tell. Until then, thank you MPOW!UPDATE: After less than a year of ownership, the structural integrity of these headphones has begun to degrade. The leatherette covering, present on the ear cushions has begun to flake. Cracks have also begun to develop in the headband. These headphones have been used lightly and have been well cared for; these are factors to consider when purchasing these headphones.Original Review: Great Pair of Bluetooth Headphones for the Price: As a certified audio professional who mainly listens to and composes rock music, I can say that at this price point you are not going to get Sennheiser, Bose or Beats audio quality out-of-the-box. However, for the price these are useable headphones that are more than capable of providing decent audio quality (once the right adjustments are made). They require a bit of frequency gain reduction between 60-250Hz to reduce boom and a boost at around 16kHz to establish clarity. Once you’ve done that you’ll have a more balanced sound from these headphones.The bluetooth volume controls, and battery status bar indicators of these headphones are natively supported on Android (but not on macOS.) In other words when you adjust the volume on your headphones it will directly adjust the volume control on your Android device. On the Mac the headphone’s volume is independent of macOS. Play/Pause and Skip buttons work natively on both platforms.There are no latency issues when watching video. Lips move in sync with audio.The MPOW 059 supports the SBC audio codec exclusively, which means no AAC or AptX is present. It would have been great to see support for AAC seeing as it is a superior codec to SBC but nonetheless sound quality is reasonable.macOS users will need to download the “Hardware IO Tools for Xcode” from Apple’s developer page in order to get the “Bluetooth Explorer” application. This application will allow you to increase the bitpool value from its default value of 40 to 53. This will dramatically improve the audio quality of these headphones and any other bluetooth headphones that rely solely on the SBC codec. For those who want specifics: a bit pool value of 53 is equal to a bitrate of 325 kbps. SBC at 325 kbps is the equivalent of MP3 at 256 kbps. When the you’ve downloaded “Hardware IO Tools for Xcode”  and have opened the Bluetooth Explorer app you will see the app’s name in your menubar. Go to “Tools > Audio Options” or “Command + Shift + A”. This will bring up the window for you to edit the SBC audio settings. Under “SBC Codec Options” Set all bitpool values to 53 and close the window. This will ensure that the audio quality remains optimal. Close the window and re-connect your Bluetooth headphones.Build quality seems reasonable, hinges are reinforced with metal. Only time will demonstrate the endurance of these headphones but superficially speaking the headphones appear to be quite sturdy. The ear-cups and headband are made of a soft synthetic leather which provides initial comfort but they are a bit shallow in depth and can place a bit of pressure on the ears when the headset is worn for an extended period of time. Battery life is reasonable. Accessories include a micro-usb cable for charging and a 3.5 mm audio cable which is handy for more critical listening and for events in which the battery has lost its charge. The velvet-like pouch is a great inclusion and provides protection against dust and scratches. These headphones are definitely worth the price and I doubt you’ll find better at this price point.",
        "I think the sound quality on this was okay. I'm definitely a little confused about these being a best seller because I'm assuming that most of the people who bought these couldn't care less about the people around them when they wear these. IE: You will be \"that\" person on a plane/bus/work who's music can be heard within a 5' radius to those around them. I wanted to keep these, but I'll be returning them because there's no way I can wear these at my office without driving my coworkers nuts. The overall look/design was fine (but I'm a 5'7 female with average sized ears and my ears barely fit). The sound quality was honestly average - even for the $30 price range though it could be better (but I didn't play with changing the equalizer on my phone - so it might have been better if I tried).Update: Changed from 2 star to 4 star (the Mpow059 is still not a 4 star)- but customer service was really good and offered to send me the newest version of these headphones (Mpow H1 Bluetooth Headphones Over Ear Lightweight, Comfortable for Prolonged Wearing, Hi-Fi Stereo Wireless Headphones, Foldable Headset w/Built-in Mic and Wired Mode for PC/Cell Phones Black-Red). These are MUCH better than the Mpow 059 ones. The design is sleeker, and the volume doesn't pollute the way the Mpow059 ones do so I've actually been wearing these in my office. They still aren't completely sound pollution proof but I asked my coworker if she could hear my music when it was at just above mid-volume and she couldn't. The diameter is also slightly bigger so my average ears feel snug but not tight like the Mpow059. I would say if you're reading this, don't get the Mpow059 ones, and instead buy the newest model (Mpow H1), which is the same price. Also, the battery life is really good. I haven't charged this since I've got them last week. I've used them for at least 15-20 hours on throughout the week. In regards to phone calls, these aren't for you to be talking on the phone all day. People had a little trouble hearing me, but I was able to answer my call just fine. If you're looking for something to have phone conversations on, you probably need headphones with an actual mic if you want to stay within this price range.",
        "I received the item in a timely fashion. I unpacked it and read the user manual. Then I charged it. The red light came on and in a couple of minutes it went out. I thought maybe it had been charged and was still holding the charge. I was able to pair it with my iPad. I listened to two tunes and then a full half hour of a britcom on YouTube. Then the battery was done. I recharged it and had a similar experience. I just returned it for a refund. Be advised that you may or may not get one that works.The company contacted me and said they would like to send me a replacement. I received the replacement and charged it. It took about 3.5 to 4 hours to charge. I then paired it with my iPad. I listened to some of my music about two CDs worth. I then watched about three of my favorite Britcoms on you tube. The audio quality was outstanding. I listened to music or watched you tube tv shows and some music tutorials for the next week and a half. I even had them on for 7.5 hours one day. I planned to wait until they needed charging before i wrote the review. They are still going strong. The fit is good and very comfortable. Now about the sound. I already said that it was outstanding.  I compared them to my Sennheiser cable head set. I honestly could not tell the difference. I then compared them to Bose wireless there was a very slight difference but not much. Overall they are extremely good. If you have trouble with them contact the company and see what they can do. I love them and could not be happierRon"
    ],
    "asin": [
        "B01NAJGGA26"
    ]
}