{
    "name": "Kids Headphones - noot products K11 Foldable Stereo Tangle-Free 3.5mm Jack Wired Cord On-Ear Headset for Children/Teens/Boys/Girls/Smartphones/School/Kindle/Airplane Travel/Plane/Tablet (Navy/Teal)",
    "catagories": "All Electronics",
    "star-rating": "4.5 out of 5 stars",
    "customer-reviews-count": "4,367 ratings",
    "long-reviews": [
        "My son's class required headphones this year for computer lab. He hates wearing anything on his head or ears. These are pretty light but sturdy and comfortable on the ears. They stay put and block outside noise. I tried them and I think I'm going to buy some for myself. I'm very impressed with the price and quality.",
        "I love these headphones! I teach in a technology lab for kindergarten. We have gone through lots of headphones the past several years. I finally decided it was worth paying a little extra to buy nice headphones. My kids think they are so comfortable! I especially love the cord. It is thick and made of a material that should definitely hold up to kids twisting it, chewing on it and jerking it. I have already ordered a second set of them.",
        "The Noot K11s are not that great, but considering you can pick them up for <$10 and that they outperform more expensive units (I compared to AILIHEN HD30 Kids Headphones, HD30 Volume Limiting Children Headset with Microphone for Girls Boys and Tablets Computer Laptops IOS Android Smartphone (White/Blue) and Intone Ms200 Intone Ms200 Stereo Low Bass Folding and Adjustable Headphone Earbuds - White / Green) in both sound quality and volume, the choice for me was obvious.I returned the HD30 (the Ms200 broke after 1.5 years) and picked up another pair of Noot K11. If they break in a year, I'll just get another one.Let me be clear - the sound quality is not even close to what any audiophile would want to use, or even a regular person, but for small kids who watch cartoons and listen to a bit of music, these are perfectly satisfactory.Pictured:- left: Noot K11- right: AILIHEN HD30Update Dec 15, 2019: Almost 2 years later, both pairs of the K11 constantly in use by 2 kids are still very much alive, to my surprise. I never thought they'd last this long.",
        "I've had them for a few weeks. Went pull them out of my kids iPad and the connector broke. C'mon. Just a few weeks. They were definitely not maltreated or rough-housed with. The metal portion got stuck in the headphone jack. Really annoying to have headphones advertised for kids and they're not made to last. Garbage. Don't buy these.",
        "These headphones did not even last 2 days before the piece that inserts into the headphone jack broke. I would not recommend these at all for childrens headphones due to their poor construction.",
        "Awesome headphones!! My son is autistic and hates certain noises. He uses these headphones ALL the time. I have been through over 50 pairs of headphones and ear muffs. He loves these and they are durable and work fantasticly. I highly recommend. It's a great product for the price.",
        "Perfect for school!  We were looking for a pair of headphones for our seven-year-old daughter‘s second grade class!  These sound fantastic, they are in stereo, they are very comfortable and the cord is perfect because it won’t get frayed and spliced like the cheap other ones we had!",
        "I bought these headphones for my son to use at school. By the end of his first day using them, the speaker stopped working in one of the ears! I returned them and got my account credited, but it was a huge disappointment and forced my son to go without sound on his iPad for school while I ordered another pair from another company."
    ],
    "asin": [
        "B0746RBK2M13"
    ]
}