{
    "name": "Panasonic Headphones RP-HT161-K Full-Sized Over-the-Ear Lightweight Long-Corded (Black)",
    "catagories": "All Electronics",
    "star-rating": "4.1 out of 5 stars",
    "customer-reviews-count": "7,239 ratings",
    "long-reviews": [
        "After nearly a month I am pleased with these. They are comfortable and allow some outside sounds to reach the listener (the Wife) when necessary. Comfortable, even when lying in bed listening to an audible book. The long cord kind of gets in the way (as did a short cord on the old ones) but is worth the very minor annoyance to place the audible reader where I want it.UPDATE -- Sept. 17, 2018Bought these in January 2018 and by the end of August stopped working. Out of warranty. They weren't expensive but I only want them for audio books, I'm functionally blind and unable to read print without complicated electronic aids. If these headphones had lasted at the very least a year I would have updated with a 2 or 3 stars. I recently purchased KOSS UR 20 for a few dollars more and I like the fit and look better (also an 8' cord) and I hope they get longer trouble free use.",
        "This is my 4th pair of RP-HT21s. They cannot be beat as the \"bang for your buck\" champion. The sound is amazing with great bottom end. I was shocked the first time I listened to them and could hear so much more in the music. And the best part is the comfort of these headphones. I wear them for hours at my desk and never have any pain in my head, ears, or neck. They just sit there. You notice the great sound but never notice the feel of the headphones. This is coming from a guy with a huge head, I have trouble buying hats because they usually don't fit.",
        "The perfect cheapo headphones. I take one to work, keep one upstairs, one downstairs, one in my travel bag, etc. They are great because they work adequately and they are fairly durable, but they cost so little. Eventually the form will wear away, the plastic piece that helps hold them to size will break away, and they'll just become more and more beat up. But they last long enough that they are totally worth it. Each pair seems to last me a couple of years with daily use.  They are perfect for more risky situations where you may have concern your equipment could get banged up or lost, or kids might get a hold of them. If they get smashed, who cares. Buy another. I bought like 4 or 5 of these. Totally worth it for situations where you don't want to take your expensive headphones.Sound quality is acceptable. If you're an audiophile, then you won't be satisfied with the quality. I use them for video streaming, video games, listening to music, etc and it always seems ok to me. They don't drown out external noise much though, so if you're in a noisy environment, it's not going to work out well.",
        "I bought my first pair of these for full price of $5.95 in December of 2013 and have never accepted discounted products. My rating criteria is as follows. If the product works as is advertised and the quality is in line with the price then I give it five stars tentatively, then deduct stars for usability problems, functionality problems, flaws, quality, etc.I've actually bought many pairs of these headphones for myself and others, and all have been of very high initial quality, and of good durability, with the price ranging up to $12 and back down to around $7.Its hard to evaluate sound quality, and I have never had the desire or cash to spend more than $25 on headphones.  But for the price I have been very happy--I've never said to myself, \"I wish these were louder,\" or \"I wish these sounded different,\" or anything else like that.  I guess my thought is that if you know enough to critically evaluate a pair of headphones beyond those two questions, you probably wouldn't buy them on the Internet where you can't listen first.  I've bought a couple other pairs of sub-$10 headphones for my wife and kids, and these are the loudest, best and longest lasting, but they insist on earbud style so they haven't switched to these full time.I don't like in-ear headphones because they tend to fall out of me ears, and eventually just get uncomfortable after an hour or so.  I guess I have a sensitive head, because I have quit using other headphones before because they squeeze too hard or the foam doesn't do its job.  These are comfortable enough for me that I can watch a movie on an airplane without discomfort.For a decent pair of headphones, you won't go wrong here.  There may be better choices, but after listening to a couple other pairs that my family uses, if I needed a new pair of headphones I wouldn't even look at anything else.As for durability, these have been very good for me.  I'm not a person who uses headphones multiple times per day, so I can't comment on how durable they are with constant, heavy use.",
        "Economic, lightweight quality.  What should one expect for headphones costing under six dollars? If your expectations are realistic, you will be pleasantly surprised with these. I was looking for a quick easy fix, and found it in these namebrand phones with prime shipping to my door in two days. I've used them for about a week. They are in fact very lightweight and comfortable. They fit firmly atop my ears (firmly enough not to slide or shake off requiring readjustment during normal use) and do not create any pressure points on the cartilage of my ear (3 to 5 hours average time per use). As to their sound quality (remember, six bucks) I'm quite pleased. I find the biggest difference is the source material, as much of what I'm listening to his web based – streaming music, YouTube, Netflix, Amazon prime video/music – and quality audio varies from clip to clip, let alone source. At six dollars, there was virtually no competition. Bargain bin, no name, knockoff earphones from Walmart, CVS, T.J. Maxx  (and the like) economy electronics' section are more expensive and hardly as reliable as Panasonic. Will I be lost in the experience as a blissful audiophile? NO WAY! Will I be able to hear what I'm listening to? No doubt! ... And that's the point"
    ],
    "asin": [
        "B075LT8YLR6"
    ]
}