{
    "name": "Pair of Single Chamber Performance Race Muffler 2.5\" Center/Center Universal Muffler (2.5 Inch)",
    "catagories": "Automotive",
    "star-rating": "4.6 out of 5 stars",
    "customer-reviews-count": "142 ratings",
    "long-reviews": [
        "Nice mufflers and sounds great. Definitely will buy again when it's time to change them out",
        "Seem to be well made , use brake cleaner to spray of and high heat paint , they turn rust really fast , use headphones on my review they sound great",
        "For the price they are not bad but coming from flowmaster 40 series these are not much louder as you would expect. Installed on a Challenger Rt with no resonators In my opinion quiet during idle but when you put the pedal to the floor it sounds like a race car. They are nothing like flowmasters though, maybe design but that's about it. If you need something louder than stock these are good but if you had aggressive mufflers before these probably are not that much louder, still not bad mufflers though",
        "Was looking for flowmasters for my 79 c10 pickup and run across these Black horse racing mufflers. I am happy I did! The sound is deep and aggressive, I dont think I'll be paying the asking price for flow masters or be buying flowmasters ever again! The quality is amazing. Great value for the price! You wont be disappointed!",
        "Built just like the Flowmaster super 10 At a way better price point. Sounds great on my vette",
        "So these mufflers are 2.5\"that I have on my 1966 ford f100 with a 352 v8 and hooker headers. The sound is amazing and at a steady 70mph on freeway the hum isnt that bad at all and mine shoot out right under the cab. They were easy to instal and were marked inlet and outlet made it super easy just to slap them up there i highly suggest these to anyone looking for a deep sound I'm very impressed...... happy customer thank you.",
        "Loud single chamber exhausts. Exact same as flowmaster super 10’s but less expensive. Get you past inspection if the law requires mufflers and sounds better than glass packs in my opinion. Expect to hear a drone but if you didn’t you wouldn’t be ordering these",
        "Great product! Perfect fit, great quality, awesome sound. Installed on a 2010 Challenger R/T Classic, with stock converters, sound is just right, not obnoxious. Noticeable improvement in torque, no annoying drone at highway speeds. Love them then, will buy again for another vehicle."
    ],
    "asin": [
        "B07K48293P1"
    ]
}