{
    "name": "Vogek On Ear Headphones with Mic, Lightweight Portable Fold-Flat Stereo Bass Headphones with 1.5M Tangle Free Cord and Microphone-Black",
    "catagories": "All Electronics",
    "star-rating": "4.5 out of 5 stars",
    "customer-reviews-count": "3,951 ratings",
    "long-reviews": [
        "I 'm  an audiophile. I have sony MDRS Sennheisers, Porta pro HD., and Grados.  The music I love goes from Iron Maiden to Lionel Richie, to Pennywise,  to Alabama I love sound... These head phones are out of the box.. They sound great. I  did not know when I purchase them they had a volume adjustment . It's so sleek you can hardly notice it but it works. I don't tell people to buy something . Boy oh boy for the price... Everyone in the world should have a set of these. They are built and sound magnificent  for your laptop or phone. If you had to go to something else I would say portapros but they break to easy.  I don't know how anyone can sell these for this price.... Buy them and then I dare you to tell me I  lied.",
        "I looked for good headphones and found these. Not too bad for the price and how they looked.Here's the pros and cons, in my opinion:Pros:- Good Sound Quality-  Able to hear/make calls on phone.Cons:- Didn't had a case (Minor)- Doesn't have an portable aux like wire to pull in/out and carry. (Minor)I couldn't describe about the noise cancellation because I'm divided on where its at. But I can give an explaination: if you're in a place that's loud, turn up the volume, or if it is quiet, make it sound at a right spot, but have some care with the eardrums as well.Bottom line: I'm digging these headphones, they are the best with what you only expect but I myself love them. High recommend.",
        "These headphones might be great, but for anyone that doesn’t have a huge skull, these won’t work. They can’t cancel noise because they don’t fit securely. Even if they were adjustable, which they are not, they have no “squeeze”, so they don’t fit securely around your ears.The pads are soft and comfortable. They sound fine, nothing exceptional. For the price, they are good headphones, but not for children or women or men that aren’t large.Rather disappointing.",
        "Using then right now. Have been using them for a good 2 weeks or so? Plan on using them for another long time. They are definitely sexy at a price this low, and this good of quality! It has a spring at the end of the aux part so it won't mess up as easily. (Unlime my other 60$ headphones XD ) they come in this small looking box, almost disappointing. But I open them up and try them out. They sound just as good as my 60$ one. I'm confident the aux end will be safe for a long time. No need to worry if your pocket is bending it. So far 2 weeks in my pocket and it's good as new. It's seriously good quality at a low price. There's a mic but no actual volume control. Not that I found at least. Friends hear my fine over the phone and on my PS4. For anyone on a low budget trying to get some good headphones, this is it. For anyone on a high budget looking for something on the small side for travel, won't have to spend much, this is it. Love this headphones.",
        "Edit to add: We have now had them almost a month and they are still in like-new condition. For my offspring that is a truly amazing thing, especially with a headset that has moving parts.  I will definitely be purchasing these again.OP: I bought these to cover an emergency loss of prior headphones for a 15y/o. They were shipped right away and the boy was impressed with them. We both like the metal connector and the spring at the connection that will help prevent breakage at that point, a place that many of my son's headphone fail. He has used them for several days and hasn't had a single complaint (could be the end of days). More importantly, this affordably priced product is still working after four days despite the fact that my teen uses them 18 hours a day. There are a great many brands that can't make that boast. I am certain that there are higher quality (and more expensive) headphones out there, with all kinds of bells and whistles probably, but given how hard the boy can be on his hardware, I will be satisfied to come back to this brand again.",
        "Great headphones. I prefer Bluetooth head phones for myself but my daughter enjoys these to watch shows while relaxing. They are compact and foldable. Their also adjustable to fit anyone. Overall great quality and work great.",
        "Good headphones for the price. These exceeded my expectations. For a brand I never heard of, I was surprised of the sound quality and details of the build. They are small and versatile when your on the go and have a long enough wire to extend comfortably. Near the headphone jack, there is some wire support so you won't find exposed wire anytime soon. The headband is on the smaller side, but you can adjust the sides to the height of your head.Place with caution as some vital areas are made out of plastic they may break if sat on or squished. It would be great if it had a volume control, but I understand it may be because to keep the costs down. The microphone works no problem as I used it for a few phone calls.",
        "Nice looking head phones. Bought 2 pair of different cheap head phones along with these, these are my favorite. Best sound of the 3 on low output device's.....tested with Kindle. Best at high output too...tested with Onkyo home reciever. Bass hits hard on high output, shakes your head. I don't want to step on any toes, so i will just say headphones on the left side of the picture are my second favorite and ones on the very right are my very, very, least favorite."
    ],
    "asin": [
        "B07MCCJ6VY4"
    ]
}