{
    "name": "Bluetooth Headphones, LETSCOM 100 Hours Playtime Wireless Headphones Over Ear with Deep Bass, Hi-Fi Sound and Soft Memory Protein Earpads for Travel/Work -Black",
    "catagories": "All Electronics",
    "star-rating": "4.5 out of 5 stars",
    "customer-reviews-count": "3,034 ratings",
    "long-reviews": [
        "MY THOUGHTS ABOUT THIS PRODUCT: I have a few products from Letscom so far I am very pleased with every product including these over the ear headphones. If your looking to get a high-end set of noise canceling headphones these are not them. However you will pay over 10 times the cost. These offer a lot for the price, you get a lot of bang for the buck. The two biggest things you really looking for is sound and comfort. Sound is pretty good, there is a bass boost button on the headphones that really make a considerable difference. I put them on and about 2 hours later I found that I was really enjoying the sound. As far as comfort goes well I wore them for 2 hours and there was no discomfort. The pads are soft over the ears and the head rest feels good on the top of the head.The noise canceling features are pretty good, these tune out most of the sounds around you when turned up to 25% at 50% there pretty loud and you basically tune anything else out. The Mic is excellent I have made quite a few phone calls and everyone says the sound is amazing. The blue tooth is really good, I was able to walk over 60 feet from the phone and the headphones never lost connection. I was able to put my phone on the charger and walk around the house freely without loosing any sound.I was able to use these quite a bit and the battery level seemed to be fine. The company states that you will get about 100 hours of play time. Something my high end headphones could never do!These also have pause/play, skip forward and back, phone answer, and volume controls. Oh yeah the bass boost button. Instructions, a charging cable and headphone jack for direct connection are included as well as a soft case to store and protect the headphones. I will also state that these have a smaller footprint when folded than my more expensive set of headphones.Overall these are awesome for the price.______________________________________________________________PROS:1. Comfort2. Nice Sound (Better than average)3. Bass Boost4. Compact storage5. They feel solid they are built well6. Easy Functionality, buttons are easy to use and function are learned quickly.7. These look good!______________________________________________________________CONS:1. I would prefer a hard case to protect these however they are relatively inexpensive so if something was to happen I would definitely just pick up another set.2. when selecting the volume button on the headset there is a clicking sound from the button (not a big deal, there is not much to complain about with these)Time will tell on the durability of this product, if this product fails or if there are any issues during my use I will update the review in a follow up and adjust my rating accordingly.______________________________________________________________SHOULD YOU BUY IT? Yes this is very nice, to be honest I will buy more for my parents to take with them for when they travel. If your looking for an in ear model I purchased their U8 model and those are amazing and have killer bass!______________________________________________________________FOLLOWUP: N/A______________________________________________________________ABOUT THIS REVIEWI take the review process very seriously, as I like many of you rely on these reviews when making purchases. As others have pointed out I would recommend that you don’t just look at the ratings on these reviews, focus on the reasoning behind the ratings as that will give you much more insight into the product. The reviewer may be looking at the product for an entirely different use or from an entirely different perspective than you are.*** If this review has helped you to make a decision please hit the Yes button below. Thank you! ***______________________________________________________________AMAZON AND MY RATING SYSTEMMy thoughts and criteria for products I review: (Amazon’s Rating Criteria in Parentheses)1 star (I hate it!): Feel it's a waste of money. Will never use it again. Would never recommend. Not safe to use. Either throw away or return it.2 stars (I don’t like it): Don't like it and wouldn't use it again, but may still have at least 1 positive thing about it.3 stars (It’s ok): Product has both positives and negatives, and I may or may not continue using it. Someone else may like it more and is potentially still worth purchasing.4 stars (I like it): Item as described in functionality purpose and quality. May have 1 or 2 things I don't care for or would change, but not big issues. Would recommend if asked, but wouldn't say I love it.5 stars (I love it!): Practically perfect. Nothing lacking in functionality or quality. I Love it and would not only recommend, but would purchase for others and continue to purchase for myself.",
        "For a pair of $25 Bluetooth headphones, they're actually very impressive!The headphones have been functioning exactly as intended from the time I got them, charged them up, and proceeded to test them. All the controls are easily found around the outside of the left ear piece. the buttons themself have a significant clicking sound, so you know that you press them when these are on your head. The \"Bass\" button actually delivers what it is selling. It does highlight the lower register of sound produced inside the headphones.I was a little concerned that these would have trouble fitting on my large head, but the adjustable sides made wearing them possible and, when tuned to the right adjustment, comfortable. Overall, these are very comfortable headphones. I tried laying on my side in bed to see if that would be doable without causing discomfort, and indeed it was surprisingly comfortable. Given the build quality, I would not expect these soft pads and the faux leather to hold up in the long run, but I'm sure you'll get plenty of use out of these before that's ever an issue.I have been running these things for hours at a time for the past couple days since I fully charged them. I don't think the battery is dying anytime soon. I will need to update once I have a good idea of how many days the charge lasted me.",
        "All I have to say is...WOW. For the price, the quality of these headphones is unexpected and 👌! The earmuffs are extremely comfortable and easily paired to my phone.I’ve only received the product today so I don’t know about the battery life but it claims to have 100 hours of play time?! Half of my battle with headphones is making sure I’ve charged them so they’re ready to use. Many times I’ve started listening to my book and then I hear the voice telling me I have low battery 😭. I won’t have to worry about that with these for days!",
        "These headphones are amazing! I originally bought a pair of $70 Cowin headphones and returned them. The old Bluetooth 4.2 connection would go in and out in the Cowin. These Letscom however have the newest Bluetooth 5.0 and the connection is much more reliable. The Cowin's would not get all that loud at all for $70 headphones, which I wasn't happy with either. These get louder than the Cowin's, the battery life with a 1,200 mAh battery is far superior to Cowin, the Bluetooth connection is superior, they are just as comfortable with protein ear pads and protein band and the sound quality is every bit as good as well! I am in awe of the quality and value of these headphones! I won't be returning these, that's for sure! I have owned many many headphones. These are by far my favorite!",
        "I thought I'd have a hard time replacing the headphones I've used for 6 years but the option to go wireless and the affordable price enticed me to place the order.  After a week of using the Bluetooth headphones for broadcasting (sound quality is awesome), phone conversations (built in mic), interviews, and everything in between, I definitely recommend them for anyone looking quality...and the plus, they don't break the bank!! Battery life is great and in a pinch, you can go wired if needed.",
        "There are many good features to highlight regarding this phone1) The phone has a plastic body with a premium finish. This makes the device extremely lightweight and easy to wear it for a long time.2) Earpads are very soft, designed for longtime use.3) It comes with extremely long battery backup.4) Upon unboxing, the also give a velvet carry case.5) Most importantly, they give a free warranty for 1 full year from the day of purchase upon registering the product.Overall this device meets my expectations and I recommend this product if you don't want to spend over 200$ for headphones."
    ],
    "asin": [
        "B07TQM2FTD10"
    ]
}